Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаЗаказовНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.КредитыИЗаймы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияБанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовПоНачислению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОплатаПоЗаказамНаПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекФискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОсновногоТелаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовПоЗайму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬЗаказыНаПроизводство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежаПоРассрочке</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.Замена</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеОперации</Name>
					<Comment>#6440</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаБанковскойКартой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаБанковскойКартой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем СтараяСуммаДокумента Экспорт;

&НаКлиенте
Перем мСуммаБонусов;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ЗаполнитьСтавкуНДСПоОрганизации(Истина);
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказамПокупателей = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	ДобавлятьДокументыПродажиПоЗаказДоговорам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
										
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	Если Параметры.Ключ.Пустая() тогда
				
		ПересчитатьБонусыПоДокументу();
		ЗаполнитьОснованияПоРаспределению();
		
		ПриЧтенииСозданииНаСервере(); // №11237
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.ГруппаРаспределениеПлатежа.Видимость = НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам); 
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	УстановитьВидимостьКнопокРаспределения();
	УстановитьВидимостьКнопкиПечатьЧека();
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	Элементы.Статья.АвтоОтметкаНезаполненного = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере(); // №11237
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанные();
	ОбновитьВидимостьГруппыБонусов();
	СтараяСуммаДокумента = Объект.Сумма;
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, , Объект.Сумма, Отказ, ПараметрыЗаписи.РежимЗаписи);
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, 
										Ложь, 
										Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам И Объект.КомиссияБанка <> 0);	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	Оповестить("ОбновитьАРМПроизводства",,"ПоступлениеНаРасчетныйСчет");
	Оповестить("Запись_ДокументОплаты",, Объект.Ссылка);
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если НЕ Объект.Валюта = ВалютаУчета Тогда
		ОбновитьДанные();
		//пересчитаем сумму распределения в валюте документа, т.к. сменился курс валюты
		ОбработкаТабличныхЧастейСервер.ПересчитатьИзВалютыВВалюту(Объект.РаспределениеПлатежа, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	ОбновитьДанные();
	ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ОсновнойДоговор, Категория");	
		Объект.Договор = РеквизитыКонтрагента.ОсновнойДоговор;
		Объект.КатегорияКонтрагента = РеквизитыКонтрагента.Категория;
	Иначе
		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Объект.КатегорияКонтрагента = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьВидимостьКнопкиПечатьЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизации();
	ОбновитьДанные();
	ПересчитатьБонусыПоДокументу();
	ЗаполнитьСтатьюДоходовРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	ПересчитатьБонусыПоДокументу();
	
	ОбновитьВидимостьГруппыБонусов();
	ОбновитьДанные();
	
КонецПроцедуры


&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	ЗаполнитьСтатьюДоходовРасходовСервер();
	УстановитьВидимостьКнопкиПечатьЧека();
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	Если НЕ КассаПриИзмененииНаСервере() Тогда
		ПоказатьПредупреждение(,"Выбран счет, не принадлежащая организации");
		Возврат;
	КонецЕсли;
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаСервере
Функция КассаПриИзмененииНаСервере()
	
	Если НЕ Объект.Счет.Владелец = Объект.Организация Тогда
		Объект.Счет = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.Счет.Валюта.Пустая() тогда
		Объект.Валюта = Объект.Счет.Валюта;
	Иначе
		Объект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	Если НЕ Объект.Валюта = ВалютаДокумента Тогда // №11237 пересчитываем если валюта была другая, было: Если НЕ Объект.Валюта = ВалютаУчета Тогда
		
		//++ №11237 сумму документа также пересчитываем
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		Объект.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаДокумента, Объект.Валюта, ДатаКурса, Объект.Сумма);
		//-- №11237
		
		//пересчитаем сумму распределения в валюте документа, т.к. сменился курс валюты
		ОбработкаТабличныхЧастейСервер.ПересчитатьИзВалютыВВалюту(Объект.РаспределениеПлатежа, Объект.Валюта, Объект.Дата, Истина);
		
		ВалютаДокумента = Объект.Валюта; // №11237
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаОсновногоТелаЗайма Тогда
		Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("СтараяСуммаДокумента", СтараяСуммаДокумента);
	ВыполнитьРаспределениеОплаты(ДополнительныеПараметры);
	
	СуммаПриИзмененииКлиент();
	
	СтараяСуммаДокумента = Объект.Сумма;
	
КонецПроцедуры

// Экспорт - вызывается из ФинансыКлиент 
&НаКлиенте
Процедура СуммаПриИзмененииКлиент() Экспорт
		
	СтараяСуммаДокумента = Объект.Сумма;
	
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	ПересчитатьБонусыПоДокументу();
	 
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	//++ №11237 нужно пересчитать из валюты в валюту если она поменялась, предварительно уточнив у пользователя
	//ОбновитьДанные();
	Если ЗначениеЗаполнено(Объект.Валюта) И НЕ ВалютаДокумента = Объект.Валюта Тогда
		Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ПрочееПоступление"))
		Тогда
			ТекстВопроса = "Пересчитать суммы документа по курсу новой валюты?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаПриИзмененииФрагмент", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВалютаПриИзмененииЗавершение();
		КонецЕсли;
	Иначе
		ВалютаПриИзмененииЗавершение();
	КонецЕсли;
	//-- №11237
	
КонецПроцедуры

//++ №11237
&НаКлиенте
Процедура ВалютаПриИзмененииФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВалютаПриИзмененииСервер(Объект.Валюта,	Истина);		
	Иначе
		Объект.Валюта = ВалютаДокумента;
	КонецЕсли;
	
	ВалютаПриИзмененииЗавершение();
		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзмененииЗавершение()
	
	ВалютаДокумента = Объект.Валюта;
	
	ОбновитьДанные();
		
КонецПроцедуры 

&НаСервере
Процедура ВалютаПриИзмененииСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
		
	Если ПересчитатьСуммы Тогда 
		
		СтараяВалюта = ВалютаДокумента;
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		
		Объект.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтараяВалюта, НоваяВалюта, ДатаКурса, Объект.Сумма);
		РаспределитьСуммуОплатыПоДокументам();
		
	КонецЕсли;
		
КонецПроцедуры
//-- №11237

&НаСервере
Процедура ЭквайринговыйТерминалПриИзмененииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	ЭквайринговыйТерминалПриИзмененииНаСервере();
КонецПроцедуры

//++ №13755
&НаКлиенте
Процедура СтатьяДоходовПриИзменении(Элемент)
	
	Объект.СтатьяДоходовПоНачислению = Объект.СтатьяДоходов;
	
КонецПроцедуры
//-- №13755

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИКоманд_ТЧРаспределение

&НаКлиенте
Процедура Распределение_Документ(Команда)
	ФинансыКлиент.Распределение_Документ(Команда, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			//НоваяСтрока.Сумма = ПолучитьСуммуДокумента(НоваяСтрока.Документ);
			НоваяСтрока.Сумма = Объект.Сумма;
			
			Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
				ДобавитьОснованиеЗаказаСервер(НоваяСтрока.Документ);
			КонецЕсли;			
			//#7709
			Если ДобавлятьДокументыПродажиПоЗаказамПокупателей ИЛИ ДобавлятьДокументыПродажиПоЗаказДоговорам Тогда
				ДобавитьДокументыПродажиПоЗаказамСервер(НоваяСтрока.Документ);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьДанные();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПослеУдаления(Элемент)
	РаспределениеОплаты(Неопределено);
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОплаты(Команда)
	
	//Если Объект.РаспределениеПлатежа.Количество() = 0 Тогда
	//	Возврат;
	//Конецесли;
	//
	//Если Объект.Проведен Тогда
	//	ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросОтменаПроведениеПередРаспределением", ЭтаФорма);
	//	ПоказатьВопрос(ОповещениеВопрос, "Будет произведено распределение суммы по документам и документ будет распроведен. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//Иначе
	//	РаспределитьСуммуОплатыПоДокументам();
	//	Модифицированность = Истина;
	//КонецЕсли;
		
	ВыполнитьРаспределениеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРаспределениеОплаты(ДополнительныеПараметры=Неопределено)

	ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
	ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "РаспределениеПлатежа", СтрокиРаспределенияПлатежей(), Объект.Сумма, ОписаниеОповещенияОбновитьДанные, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция СтрокиРаспределенияПлатежей()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.РаспределениеПлатежа.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОписаниеОповещенияОбновитьДанные(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьДанные();
КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВопросОтменаПроведениеПередРаспределением(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения)) Тогда
//			РаспределитьСуммуОплатыПоДокументам();
//			ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПослеРаспределения", ЭтаФорма);
//			ПоказатьВопрос(ОповещениеВопрос, "Провести документ?", РежимДиалогаВопрос.ДаНет);
//			//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//		КонецЕсли;
//	Иначе
//		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
//			Если ДополнительныеПараметры.Свойство("СтараяСуммаДокумента") Тогда	
//				Объект.Сумма = ДополнительныеПараметры.СтараяСуммаДокумента;
//				СтараяСуммаДокумента = ДополнительныеПараметры.СтараяСуммаДокумента;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВопросПроведениеПослеРаспределения(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
//			Модифицированность = Истина;
//		КонецЕсли;
//	Иначе
//		Модифицированность = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуОплатыПоДокументам()
	ОбработкаТабличныхЧастейСервер.РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределенияПлатежей(), Объект.Сумма, Объект.Дата, Объект.Валюта);
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПереплатаНаПоследнийДокумент(Команда)
	РаспределитьПереплатуНаПоследнийДокумент();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РаспределитьПереплатуНаПоследнийДокумент()
	ОбработкаТабличныхЧастейСервер.РаспределитьПереплатуНаПоследнийДокумент(Объект.РаспределениеПлатежа, Объект.Сумма, Объект.Дата, Объект.Валюта);
	ОбновитьДанные();
КонецПроцедуры 

&НаКлиенте
Процедура РаспределениеПлатежаСуммаПриИзменении(Элемент)
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере();
	
	ТекущаяСтрока = Элементы.РаспределениеПлатежа.ТекущиеДанные;	
	Если НЕ Объект.Валюта = ВалютаУчета И НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	
	ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере()
	
	Возврат ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийИКоманд_ТЧРаспределение

&НаКлиенте
Процедура ЭквайринговыеОперации_ЗаполнитьПоПериоду(Команда)
	
	ВыполнитьВозврат = ПроверитьРеквизитыПередЗаполнениемТабличнойЧастиЭквайринговыеОперации();
	Если ВыполнитьВозврат Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЭквайринговыеОперации_ЗаполнитьПоПериодуЗавершение", ЭтотОбъект);
	Если Объект.ЭквайринговыеОперации.Количество() > 0 Тогда
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, НСтр("ru='Эквайринговые операции будут полностью перезаполнены. Продолжить?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		ОткрытьФормуВыбораПериодаРасчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперации_ЗаполнитьПоПериодуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуВыбораПериодаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПериодаРасчета()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ПериодДатаОкончания", Объект.Дата);	
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОткрытьФормуВыбораПериодаРасчетаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПериода", ПараметрыЗаполнения, ЭтотОбъект, УникальныйИдентификатор,,, ОписаниеОповещенияОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПериодаРасчетаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЭквайринговыеОперации_ЗаполнитьПоПериодуНаСервере(Результат.ПериодДатаНачала, Результат.ПериодДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЭквайринговыеОперации_ЗаполнитьПоПериодуНаСервере(ДатаНачала = '00010101', ДатаОкончания = '00010101')
	
	Модифицированность = Истина;
	
	//схожий запрос в общей форме подбора долгов по эквайрингу
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", Объект.ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЭквайрингу.Документ КАК Документ,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыПоЭквайрингу.КомиссияБанкаПриход - РасчетыПоЭквайрингу.КомиссияБанкаРасход
	|		КОНЕЦ) КАК СуммаКомиссии,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВозврата,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоЭквайрингу.Документ ССЫЛКА Документ.ОплатаБанковскойКартой
	|					И РасчетыПоЭквайрингу.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
	|				ТОГДА РасчетыПоЭквайрингу.КомиссияБанкаПриход - РасчетыПоЭквайрингу.КомиссияБанкаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКомиссииВозврата
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И ЭквайринговыйТерминал = &ЭквайринговыйТерминал
	|				И (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)) КАК РасчетыПоЭквайрингу
	|ГДЕ
	|	РасчетыПоЭквайрингу.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЭквайрингу.Документ
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЭквайрингу.СуммаПриход - РасчетыПоЭквайрингу.СуммаРасход) > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ЭквайринговыеОперации.Загрузить(РезультатЗапроса.Выгрузить());
	
	// сумму документа меняем, если только она равна 0
	СуммаОпераций = Объект.ЭквайринговыеОперации.Итог("Сумма") - Объект.ЭквайринговыеОперации.Итог("СуммаВозврата");
	СуммаКомиссий = Объект.ЭквайринговыеОперации.Итог("СуммаКомиссии") - Объект.ЭквайринговыеОперации.Итог("СуммаКомиссииВозврата");	
	Если Объект.Сумма = 0 Тогда
		Объект.Сумма = СуммаОпераций - СуммаКомиссий;
		Объект.КомиссияБанка = СуммаКомиссий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперации_Подбор(Команда)
	
	ВыполнитьВозврат = ПроверитьРеквизитыПередЗаполнениемТабличнойЧастиЭквайринговыеОперации();
	Если ВыполнитьВозврат Тогда
		Возврат;
	КонецЕсли;
	
	АдресЭквайринговыеОперацииВХранилище = ПоместитьЭквайринговыеОперацииВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресЭквайринговыеОперацииВХранилище,
		|Организация,
		|Дата,
		|Ссылка,
		|Валюта,
		|СуммаДокумента,
		|ЭквайринговыйТерминал",
		АдресЭквайринговыеОперацииВХранилище,
		Объект.Организация,
		Объект.Дата,
		Объект.Ссылка,
		Объект.Валюта,
		Объект.Сумма,
		Объект.ЭквайринговыйТерминал
	);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЭквайрингПодборЗавершение", ЭтотОбъект, Новый Структура("АдресЭквайринговыеОперацииВХранилище", АдресЭквайринговыеОперацииВХранилище));
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораДолговПоЭквайрингу", ПараметрыПодбора,,,,,ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьЭквайринговыеОперацииВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ЭквайринговыеОперации.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьЭквайринговыеОперацииВХранилище()

&НаКлиенте
Процедура ЭквайрингПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресЭквайринговыеОперацииВХранилище = ДополнительныеПараметры.АдресЭквайринговыеОперацииВХранилище;
	
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьЭквайринговыеОперацииИзХранилища(АдресЭквайринговыеОперацииВХранилище);
		
		СуммаОпераций = Объект.ЭквайринговыеОперации.Итог("Сумма") - Объект.ЭквайринговыеОперации.Итог("СуммаВозврата");
		СуммаКомиссий = Объект.ЭквайринговыеОперации.Итог("СуммаКомиссии") - Объект.ЭквайринговыеОперации.Итог("СуммаКомиссииВозврата");	
		Объект.Сумма = СуммаОпераций - СуммаКомиссий;
		Объект.КомиссияБанка = СуммаКомиссий;
	
	КонецЕсли;

КонецПроцедуры // ЭквайрингПодборЗавершение()

&НаСервере
Процедура ПолучитьЭквайринговыеОперацииИзХранилища(АдресЭквайринговыеОперацииВХранилище)
	
	ТаблицаЭквайринговыеОперации = ПолучитьИзВременногоХранилища(АдресЭквайринговыеОперацииВХранилище);
	Объект.ЭквайринговыеОперации.Очистить();
	Для каждого СтрокаЭквайринговыеОперации Из ТаблицаЭквайринговыеОперации Цикл
		Строка = Объект.ЭквайринговыеОперации.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаЭквайринговыеОперации);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

#КонецОбласти

#Область ПечатьЧека

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Если Объект.ЧекФискализирован Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на оборудовании!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//++ №7951 необходимо проверить права на объекты распределения, как минимум должно быть чтение
	Если НЕ ПотолкиКассыОнлайн.ПроверитьДоступКДокументамРаспределения(Объект) Тогда
		Возврат;
	КонецЕсли;	
	//-- №7951
		
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);	
	Если ПотолкиКассыОнлайнКлиент.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		ПечатьЧекаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаКлиент()
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Объект.Контрагент);
	ПараметрыОперации.Вставить("Организация",              Объект.Организация);
	ПараметрыОперации.Вставить("ПодключенноеОборудование", Неопределено); //ФискальнаяОперацияПодключенноеОборудование);
		
	ОписаниеОповещенияПриЗавершении = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект);
	ОткрытьФорму(
			"Обработка.ПредпросмотрЧека.Форма",
			ПараметрыОперации,
			ЭтотОбъект,,,,
			ОписаниеОповещенияПриЗавершении);
			
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ПечатьЧекаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения = Неопределено И НЕ РезультатВыполнения = КодВозвратаДиалога.Отмена Тогда
		Если РезультатВыполнения.Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = РезультатВыполнения.НомерСмены;
			Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККМ;
			
			Объект.ЧекФискализирован = Истина;;
			Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
						
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			Если НЕ ЗаписатьДокументНаФорме(ПараметрыЗаписи) Тогда
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЖурналаФискальныхОпераций(Команда)
	
	ФискальнаяОперацияДанныеЖурнала = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФискальнаяОперацияДанныеЖурнала = ПотолкиКассыОнлайн.ДанныеЖурналаФискальныхОпераций(Объект.Ссылка);
	КонецЕсли;
	Если ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		Сообщить("Документ не проведен, не пробит чек или отсутствует запись в журнале");
	Иначе
		ПотолкиКассыОнлайнКлиент.ОткрытьЗаписьЖурналаФискальныхОпераций(ЭтотОбъект, ФискальнаяОперацияДанныеЖурнала);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанные()
	
	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.ГруппаЭквайринговыйТерминал.Видимость = Ложь;
	Элементы.ГруппаЭквайринговыеОперации.Видимость = Ложь; //#6440 
	Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Истина;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
	Элементы.РаспределениеПлатежаДатаПлатежаПоРассрочке.Видимость = Ложь;
	Элементы.ГруппаСуммыРаспределения.Видимость = Ложь;
	Элементы.СуммаОсновногоТелаЗайма.Видимость = Ложь;  
	Элементы.СуммаПроцентовПоЗайму.Видимость = Ложь;  
	Элементы.РаспределениеПлатежаГруппаВозврат.Видимость = Ложь; //#7080
	Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Ложь;  //#7080
	
	//#9708
	Элементы.СтатьяДоходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
									И Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПрочееПоступление
									//++ №13755
									И ЗначениеЗаполнено(Объект.Ссылка)
									И НЕ (Объект.СтатьяДоходов = Объект.СтатьяДоходовПоНачислению);
									//-- №13755
									
	Элементы.СтатьяДоходов.Видимость = Истина; // #12545								
	//управляем видимостью элементов в зависимости от того, какой вид операции
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя Тогда
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаДатаПлатежаПоРассрочке.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Истина;
		Элементы.ГруппаСуммыРаспределения.Видимость = Истина;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, Объект.Дата);
		// №7373 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПолучениеКредита ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратЗайма Тогда
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
		Элементы.РаспределениеПлатежаДатаПлатежаПоРассрочке.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Истина;
		Элементы.ГруппаСуммыРаспределения.Видимость = Истина;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Ложь;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, Объект.Дата);
		// №7373 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
	    Элементы.СтатьяДоходов.Видимость = Ложь;
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратЗайма Тогда
			Элементы.СтатьяДоходов.Видимость = Истина;
			Элементы.СуммаОсновногоТелаЗайма.Видимость = Истина;  
			Элементы.СуммаПроцентовПоЗайму.Видимость = Истина;  
	    КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ИнкассацияВБанк Тогда
		// контрагент в перации не нужен
		//Элементы.ГруппаКонтрагент.Видимость = Истина;
		//Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, Объект.Дата);
		// №7373 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта; //Константы.ВалютаУчета.Получить();
		Элементы.СтатьяДоходов.Видимость = Ложь; // #12545
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам Тогда
		Элементы.ГруппаЭквайринговыйТерминал.Видимость = Истина;
		Элементы.ОснованияЗаполнитьОснованияПоРаспределению.Видимость = Ложь;
		Элементы.ГруппаЭквайринговыеОперации.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу"); //#6440
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПрочееПоступление Тогда
		// №12420 контрагент не нужен Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплата.Видимость = Истина;
		// №12420 контрагент не нужен Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, Объект.Дата);
		// №7373 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
		
	//#7080	
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика Тогда
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаВозврат.Видимость = Истина;
		Элементы.ДекорацияСуммаДолга.Заголовок = ПолучитьСтоимостьЗаказовВРаботе(Объект.Контрагент, Объект.Валюта, ТекущаяДатаСеанса()) +    //nva
			ПолучитьТекущийДолгКлиента(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.Валюта, ВалютаУчета, Объект.Дата);
		// №7373 валюту показываем выбранную в текущем документе
		Элементы.ДекорацияНадписьВалютаДолга.Заголовок = Объект.Валюта;
		
	КонецЕсли;
	//Элементы.ГруппаРаспределениеПлатежа.Видимость = НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам); 
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
	СписокДокументовРаспределения = Объект.РаспределениеПлатежа.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ОсталосьРаспределить,
	|	РасчетыПоЗаказамОстатки.Заказ КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРаспределения Из Объект.РаспределениеПлатежа Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда 
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
			Иначе
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта; 
				СтрокаРаспределения.СуммаДокументаВВалютеДокумента = НайденныеСтроки[0].СуммаДокумента;
				СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].СуммаДокумента);
				СтрокаРаспределения.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].ОсталосьРаспределить);
			КонецЕсли;
		Иначе
			Попытка
				Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
				Иначе
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта; 
					СтрокаРаспределения.СуммаДокументаВВалютеДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтрокаРаспределения.Документ.Валюта, Объект.Валюта, Объект.Дата, СтрокаРаспределения.Документ.СуммаДокумента);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокРаспределения()
	Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Получить();
	Элементы.ГруппаРаспределениеЗаказДоговор.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоСчетуНаОплату.Получить();
	Элементы.ГруппаРаспределениеСчетНаОплату.Видимость = Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость;
	
	//НАЧАЛО: Переход на 2.0
	//Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость = Константы.ВестиРасчетыПоЗаказамПоЗаказуНаПроизводство.Получить();
	//Элементы.ГруппаРаспределениеЗаказНаПроизводство.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость;
	//КОНЕЦ: Переход на 2.0
	
	Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость	 = Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Получить();
	Элементы.ГруппаРаспределениеЗаказПокупателя.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Элементы.ГруппаРаспределениеРТиУ.Видимость = Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость				 = Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Элементы.ГруппаРаспределениеМонтаж.Видимость = Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость; 
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиПечатьЧека()
	
	ДопускаетсяПечатьЧека = (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя)
	                        И (Объект.Контрагент.ВидКонтрагента = Перечисления.ВидКонтрагента.ФизЛицо);
	Элементы.ФормаПечатьЧека.Видимость = ДопускаетсяПечатьЧека;
	 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийДолгКлиента(Знач Организация, Знач Контрагент, Знач Договор, Знач ВалютаДокумента, Знач ВалютаУчета, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Договор = &Договор
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// №7373 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
		Сумма = Выборка.СуммаОстаток;
		Если НЕ ВалютаДокумента = ВалютаУчета Тогда
			Сумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, Дата, Сумма), 2);
		КонецЕсли;	
		Возврат Сумма;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

//nva+++
&НаСервереБезКонтекста
Функция ПолучитьСтоимостьЗаказовВРаботе(Знач Контрагент, Знач ВалютаДокумента, Дата)
	
	ТекущийСтатус = Новый СписокЗначений;
	ТекущийСтатус.Добавить(Справочники.СтатусыЗаказовПокупателей.ВРаботе);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказыПокупателей.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗаказыПокупателей.ЗаказНаПроизводство.Валюта КАК Валюта,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.ТекущийСтатус КАК ТекущийСтатус,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.СуммаДокумента КАК СуммаДокумента,
	//|	ЗаказыПокупателей.ЗаказНаПроизводство.Комментарий КАК Комментарий,
	|	ЗаказыПокупателей.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			&ТекущаяДата,
	|			ЗаказНаПроизводство.Контрагент = &Контрагент
	|				И ЗаказНаПроизводство.ТекущийСтатус В (&ТекущийСтатус)) КАК ЗаказыПокупателей";
	Запрос.УстановитьПараметр("ТекущаяДата",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекущийСтатус",ТекущийСтатус);
	
	// №7373 сумму долга показываем в валюте текущего документа, если валюта отличается от валюты учета
	//ОжидаемаяСумма = Запрос.Выполнить().Выгрузить().Итог("СуммаДокумента");
	ОжидаемаяСумма = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПересчитаннаяСумма = Выборка.СуммаОстаток; //Выборка.СуммаДокумента;
		Если НЕ ВалютаДокумента = Выборка.Валюта Тогда
			ПересчитаннаяСумма = Окр(РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Выборка.Валюта, ВалютаДокумента, Дата, ПересчитаннаяСумма), 2);
		КонецЕсли;
		ОжидаемаяСумма = ОжидаемаяСумма + ПересчитаннаяСумма;
	КонецЦикла;	
	
	Возврат ОжидаемаяСумма;
	
КонецФункции
//nva---

&НаСервере
Процедура ДобавитьОснованиеЗаказаСервер(ДокументСчет)
	
	ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ДокументСчет, Объект.РаспределениеПлатежа, Объект.Сумма);
	
	//СписокДокументовКДобавлению = Новый ТаблицаЗначений;
	//СписокДокументовКДобавлению.Колонки.Добавить("Документ");
	//СписокДокументовКДобавлению.Колонки.Добавить("СуммаДокумента");
	//
	//Если ТипЗнч(ДокументСчет) = Тип("ДокументСсылка.СчетНаОплату") Тогда
	//	Если ТипЗнч(ДокументСчет.Основание) = Тип("ДокументСсылка.СчетНаОплату")
	//		или ТипЗнч(ДокументСчет.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
	//		//или ТипЗнч(ДокументСчет.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") //Переход на 2.0
	//		или ТипЗнч(ДокументСчет.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//		
	//		Если НЕ ДокументСчет.Основание.Пустая() Тогда
	//			НоваяСтрока = СписокДокументовКДобавлению.Добавить();
	//			НоваяСтрока.Документ = ДокументСчет.Основание;
	//			НоваяСтрока.СуммаДокумента = ДокументСчет.Основание.СуммаДокумента;
	//		КонецЕсли;
	//		Для Каждого СтрокаОснований Из ДокументСчет.ДокументыОснования Цикл
	//			Если ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.СчетНаОплату")
	//				или ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.ЗаказДоговор")
	//				//или ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.ЗаказНаПроизводство") //Переход на 2.0
	//				или ТипЗнч(СтрокаОснований.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//				
	//				Если НЕ СтрокаОснований.Документ.Пустая() Тогда
	//					НоваяСтрока = СписокДокументовКДобавлению.Добавить();
	//					НоваяСтрока.Документ = СтрокаОснований.Документ;
	//					НоваяСтрока.СуммаДокумента = СтрокаОснований.Документ.СуммаДокумента;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(ДокументСчет) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
	//	Если ТипЗнч(ДокументСчет.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату")
	//		или ТипЗнч(ДокументСчет.ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор")
	//		//или ТипЗнч(ДокументСчет.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаПроизводство") //Переход на 2.0
	//		или ТипЗнч(ДокументСчет.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//		
	//		Если НЕ ДокументСчет.ДокументОснование.Пустая() Тогда
	//			НоваяСтрока = СписокДокументовКДобавлению.Добавить();
	//			НоваяСтрока.Документ = ДокументСчет.ДокументОснование;
	//			НоваяСтрока.СуммаДокумента = ДокументСчет.ДокументОснование.СуммаДокумента;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Для Каждого ДокументКДобавлению Из СписокДокументовКДобавлению Цикл
	//	ПараметрыПоиска = Новый Структура;
	//	ПараметрыПоиска.Вставить("Документ",ДокументКДобавлению.Документ);
	//	Если Объект.РаспределениеПлатежа.НайтиСтроки(ПараметрыПоиска).Количество() = 0 Тогда
	//		НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
	//		НоваяСтрока.Документ = ДокументКДобавлению.Документ;
	//		НоваяСтрока.Сумма = ДокументКДобавлению.СуммаДокумента;
	//	КонецЕсли;
	//КонецЦикла
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокументыПродажиПоЗаказамСервер(ОбъектОснование)
	ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(Объект, ОбъектОснование);
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДокумента(Ссылка)
	Если НЕ Ссылка.Метаданные().Реквизиты.Найти("СуммаДокумента") = Неопределено Тогда 
		Возврат Ссылка.СуммаДокумента;
	ИначеЕсли НЕ Ссылка.Метаданные().Реквизиты.Найти("Сумма") = Неопределено Тогда 
		Возврат Ссылка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЗаписатьДокументНаФорме(ПараметрыЗаписи)
	
	Попытка
		Результат = ЭтотОбъект.Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента)
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьРеквизитыПередЗаполнениемТабличнойЧастиЭквайринговыеОперации()
		
	ВыполнитьВозврат = Ложь;
	Если Объект.Организация.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Укажите организацию!'");		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Организация", "Объект", ВыполнитьВозврат);
	КонецЕсли;

	Если Объект.ЭквайринговыйТерминал.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Укажите эквайринговый терминал!'");		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ЭквайринговыйТерминал", "Объект", ВыполнитьВозврат);
	КонецЕсли;
	
	Возврат ВыполнитьВозврат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	
	Если НЕ Объект.ВидОперации.Пустая() Тогда
    	Объект.СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперации);
		Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперации, Ложь);
		Объект.СтатьяДоходовПоНачислению = Объект.СтатьяДоходов; //#9708
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.НачислятьБонусы 
		И НЕ мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте Тогда
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеБонусовПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		БонусыКлиент.ПодтвердитьИзменениеСуммыБонусов(ОписаниеОповещения, Объект.СуммаБонусовКНачислениюПоДисконтнойКарте, мСуммаБонусов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБонусовПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации(ТолькоИзменениеФормы = Ложь)
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	Элементы.ГруппаНДС.Видимость = УчитыватьНДС;
	
	Если НЕ ТолькоИзменениеФормы Тогда
		Объект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыБонусов()
	
	Элементы.ГруппаБонусыТекущиеДанные.Видимость = Объект.НачислятьБонусы И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя"));
	Элементы.ДисконтнаяКарта.Видимость = Объект.НачислятьБонусы И Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыПоДокументу()
	
	Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	Если Объект.НачислятьБонусы Тогда		
		//Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.Контрагент.Категория, Объект.Счет, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		СтруктураБонусов = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.КатегорияКонтрагента, Объект.Счет, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = СтруктураБонусов.СуммаБонусов;
		Объект.ДокументНАНБ = СтруктураБонусов.ДокументНАНБ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОснованияПоРаспределениюКоманда(Команда)
	
	Если Объект.Основания.Количество() > 0 Тогда
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчищенииТаблицыОснования", ЭтотОбъект), "Табличная часть основания будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТаблицыОснования(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Основания.Очистить();
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованияПоРаспределению()
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьОснованияПоРаспределению(Объект.Основания, Объект.РаспределениеПлатежа);
		
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовПоЗаймуПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаПроцентовПоЗайму Тогда
		 Объект.СуммаОсновногоТелаЗайма = Объект.Сумма - Объект.СуммаПроцентовПоЗайму;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОсновногоТелаЗаймаПриИзменении(Элемент)
	Если Объект.Сумма > 0 И Объект.Сумма > Объект.СуммаОсновногоТелаЗайма Тогда
		Объект.СуммаПроцентовПоЗайму = Объект.Сумма - Объект.СуммаОсновногоТелаЗайма;
	КонецЕсли;
КонецПроцедуры
